avionic-design/u-boot/arch/arm/cpu/arm926ejs/lpc3250/board.c
	value = readl(&clkpwr->sysclk_ctrl);
	value &= ~(CLKPWR_SYSCTRL_BP_MASK | CLKPWR_SYSCTRL_USEPLL397);
	value |= CLKPWR_SYSCTRL_BP_TRIG(bp);

	if (osc == CLKPWR_OSC_PLL397)
		value |= CLKPWR_SYSCTRL_USEPLL397;

	writel(value, &clkpwr->sysclk_ctrl);
}

static void clkpwr_pll397_setup(bool bypass, u32 bias, bool pll)
{
	struct lpc32xx_clkpwr_regs *clkpwr = (struct lpc32xx_clkpwr_regs *)LPC32XX_CLKPWR;
	u32 value;

	value = readl(&clkpwr->pll397_ctrl);
	value &= ~(CLKPWR_PLL397_CTRL_BYPASS | CLKPWR_PLL397_CTRL_BIAS_MASK | CLKPWR_PLL397_CTRL_DISABLE);

	if (bypass)
		value |= CLKPWR_PLL397_CTRL_BYPASS;

	value |= bias;

	if (pll)
		value |= CLKPWR_PLL397_CTRL_DISABLE;

	writel(value, &clkpwr->pll397_ctrl);
}

static u32 clkpwr_check_pll_setup(u32 input, struct clkpwr_hclk_pll_setup *setup)
{
	u32 mode = (setup->bypass << 2) | (setup->direct << 1) | (setup->fdbk << 0);
	u64 freq = 0;
	u64 cco = 0;
	u64 ref = 0;
	u64 p, n, m;

	p = setup->pllp;
	n = setup->plln;
	m = setup->pllm;

	switch (mode) {
	case 0:
		freq = m * input;
		do_div(freq, 2 * p * n);
		cco = m * input;
		do_div(cco, n);
		ref = input;
		do_div(ref, n);
		break;

	case 1:
		freq = m * input;
		do_div(freq, n);
		cco = m * input;
		do_div(cco, 2 * p * n);
		ref = input;
		do_div(ref, n);
		break;

	case 2:
	case 3:
		freq = m * input;
		do_div(freq, n);
		cco = freq;
		ref = input;
		do_div(ref, n);
		break;

	case 4:
	case 5:
		freq = input;
		do_div(freq, 2 * p);
		cco = 156000000;
		ref = 1000000;
		break;

	case 6:
	case 7:
		freq = input;
		cco = 156000000;
		ref = 1000000;
		break;
	}

	if ((cco < 156000000) || (cco > 320000000))
		freq = 0;

	if ((ref < 1000000) || (ref > 27000000))
		freq = 0;

	return freq;
}

static u32 pll_postdivs[4] = { 1, 2, 4, 8 };

static s32 clkpwr_abs(s32 v1, s32 v2)
{
	if (v1 > v2)
		return v1 - v2;

	return v2 - v1;
}

static u32 clkpwr_find_pll_config(u32 input, u32 target, s32 tol, struct clkpwr_hclk_pll_setup *setup)
{
	bool flag = false;
	u32 clkout = 0;
	u32 ret = 0;
	u32 m, n, p;
	u64 lfreq;
	u32 freq;

	lfreq = (u64)target * (u64)tol;
	do_div(lfreq, 1000);
	freq = (u32)lfreq;

	if (clkpwr_abs(input, target) < freq) { /* direct bypass mode */
		setup->analog = 0;
		setup->bypass = 1;
		setup->direct = 1;
		setup->fdbk = 1;
		setup->pllp = pll_postdivs[0];
		setup->plln = 1;
		setup->pllm = 1;

		clkout = clkpwr_check_pll_setup(input, setup);
	} else if (target < input) { /* bypass mode */
		setup->analog = 0;
		setup->bypass = 1;
		setup->direct = 0;
		setup->fdbk = 1;
		setup->plln = 1;
		setup->pllm = 1;

		for (p = 0; p <= 3; p++) {
			setup->pllp = pll_postdivs[p];
			clkout = clkpwr_check_pll_setup(input, setup);
			if (clkpwr_abs(target, clkout) <= freq) {
				flag = true;
				break;
			}
		}
	}

	if (!flag) { /* direct mode */
		setup->analog = 1;
		setup->bypass = 0;
		setup->direct = 1;
		setup->fdbk = 0;
		setup->pllp = pll_postdivs[0];

		for (m = 1; m <= 256; m++) {
			for (n = 1; n <= 4; n++) {
				setup->plln = n;
				setup->pllm = m;

				clkout = clkpwr_check_pll_setup(input, setup);
				if (clkpwr_abs(target, clkout) <= freq) {
					flag = true;
					break;
				}
			}

			if (flag)
				break;
		}
	}

	/* integer mode */
	if (!flag) {
		setup->analog = 1;
		setup->bypass = 0;
		setup->direct = 0;
		setup->fdbk = 1;

		for (m = 1; m <= 256; m++) {
			for (n = 1; n <= 4; n++) {
				for (p = 0; p < 4; p++) {
					setup->pllp = pll_postdivs[p];
					setup->plln = n;
					setup->pllm = m;

					clkout = clkpwr_check_pll_setup(input, setup);
					if (clkpwr_abs(target, clkout) <= freq) {
						flag = true;
						break;
					}
				}

				if (flag)
					break;
			}

			if (flag)
				break;
		}
	}

	/* try non-integer mode */
	if (!flag) {
		setup->analog = 1;
		setup->bypass = 0;
		setup->direct = 0;
		setup->fdbk = 0;

		for (m = 1; m <= 256; m++) {
			for (n = 1; n <= 4; n++) {
				for (p = 0; p < 4; p++) {
					setup->pllp = pll_postdivs[p];
					setup->plln = n;
					setup->pllm = m;

					clkout = clkpwr_check_pll_setup(input, setup);
					if (clkpwr_abs(target, clkout) <= freq) {
						flag = true;
						break;
					}
				}

				if (flag)
					break;
			}

			if (flag)
				break;
		}
	}

	if (flag)
		ret = clkout;

	return ret;
}

static u32 hclk_divs[4] = { 1, 2, 4, 4 };

static enum clkpwr_osc clkpwr_get_osc(void)
{
	struct lpc32xx_clkpwr_regs *clkpwr = (struct lpc32xx_clkpwr_regs *)LPC32XX_CLKPWR;
	enum clkpwr_osc ret = CLKPWR_OSC_MAIN;
	u32 value;

	value = readl(&clkpwr->sysclk_ctrl);

	if (value & CLKPWR_SYSCTRL_SYSCLKMUX)
		ret = CLKPWR_OSC_PLL397;

	return ret;
}

static u32 clkpwr_pll_rate(u32 clkrate, u32 value)
{
	struct clkpwr_hclk_pll_setup setup;

	memset(&setup, 0, sizeof(setup));

	if (value & CLKPWR_HCLKPLL_CCO_BYPASS)
		setup.bypass = 1;

	if (value & CLKPWR_HCLKPLL_POSTDIV_BYPASS)
		setup.direct = 1;

	if (value & CLKPWR_HCLKPLL_FDBK_SEL_FCLK)
		setup.fdbk = 1;

	setup.pllp = pll_postdivs[(value >> 11) & 0x3];
	setup.pllm = 1 + ((value >> 1) & 0xff);
	setup.plln = 1 + ((value >> 9) & 0x03);

	return clkpwr_check_pll_setup(clkrate, &setup);
}

static u32 clkpwr_get_base_clock_rate(enum clkpwr_clk clock)
{
	struct lpc32xx_clkpwr_regs *clkpwr = (struct lpc32xx_clkpwr_regs *)LPC32XX_CLKPWR;
	u32 sysclk, hclk, ddrclk, pclk, armclk;
	u32 hclk_div = 0;
	u32 value;
	u32 ret;

	value = readl(&clkpwr->sysclk_ctrl);

	if (value & CLKPWR_SYSCTRL_USEPLL397)
		sysclk = CLOCK_OSC_FREQ * 397;
	else
		sysclk = MAIN_OSC_FREQ;

	value = readl(&clkpwr->sdram_clk_ctrl);

	if (value & CLKPWR_SDRCLK_USE_DDR) {
		value = readl(&clkpwr->hclk_div);

		if (value & CLKPWR_HCLKDIV_DDRCLK_NORM)
			hclk_div = 1;
		else if (value & CLKPWR_HCLKDIV_DDRCLK_HALF)
			hclk_div = 2;
	} else {
		value = readl(&clkpwr->hclk_div);
		value &= CLKPWR_HCLKDIV_DIV_2POW(0x3);
		hclk_div = hclk_divs[value] - 1;
	}

	value = readl(&clkpwr->pwr_ctrl);

	if (value & CLKPWR_SELECT_RUN_MODE) {
		u32 div;

		value = readl(&clkpwr->hclk_pll_ctrl);
		hclk = clkpwr_pll_rate(sysclk, value);
		ddrclk = hclk;

		value = readl(&clkpwr->hclk_div);
		div = 1 + ((value >> 2) & 0x1f);
		pclk = hclk / div;

		hclk = hclk / hclk_divs[CLKPWR_HCLKDIV_DIV_2POW(div)];
		armclk = hclk;
	} else {
		ddrclk = sysclk;
		pclk = sysclk;
		hclk = sysclk;
		armclk = sysclk;
	}

	ddrclk = ddrclk / (hclk_div + 1);

	value = readl(&clkpwr->pwr_ctrl);

