avionic-design/u-boot/arch/arm/cpu/arm926ejs/lpc3250/board.c
	if (value & CLKPWR_PWR_CTRL_FORCE_PCLK) {
		hclk = pclk;
		armclk = pclk;
	}

	switch (clock) {
	case CLKPWR_CLK_MAINOSC:
		ret = MAIN_OSC_FREQ;
		break;

	case CLKPWR_CLK_RTC:
		ret = CLOCK_OSC_FREQ;
		break;

	case CLKPWR_CLK_SYS:
		ret = sysclk;
		break;

	case CLKPWR_CLK_ARM:
		ret = armclk;
		break;

	case CLKPWR_CLK_HCLK:
	case CLKPWR_CLK_MSSD:
		ret = hclk;
		break;

	case CLKPWR_CLK_PERIPH:
		ret = pclk;
		break;

	case CLKPWR_CLK_DDR:
		ret = ddrclk;
		break;

	case CLKPWR_CLK_USB:
	case CLKPWR_CLK_48M:
	default:
		ret = 0;
		break;
	}

	return ret;
}

static u32 clkpwr_hclkpll_setup(struct clkpwr_hclk_pll_setup *setup)
{
	struct lpc32xx_clkpwr_regs *clkpwr = (struct lpc32xx_clkpwr_regs *)LPC32XX_CLKPWR;
	u32 value = 0;
	u32 div = 0;

	if (setup->analog)
		value |= CLKPWR_HCLKPLL_POWER_UP;

	if (setup->bypass)
		value |= CLKPWR_HCLKPLL_CCO_BYPASS;

	if (setup->direct)
		value |= CLKPWR_HCLKPLL_POSTDIV_BYPASS;

	if (setup->fdbk)
		value |= CLKPWR_HCLKPLL_FDBK_SEL_FCLK;

	switch (setup->pllp) {
	case 1:
		div = 0;
		break;

	case 2:
		div = 1;
		break;

	case 4:
		div = 2;
		break;

	case 8:
		div = 3;
		break;

	default:
		return 0;
	}

	value |= CLKPWR_HCLKPLL_POSTDIV_2POW(div);
	value |= CLKPWR_HCLKPLL_PREDIV_PLUS1(setup->plln - 1);
	value |= CLKPWR_HCLKPLL_PLLM(setup->pllm - 1);

	writel(value, &clkpwr->hclk_pll_ctrl);

	return clkpwr_check_pll_setup(clkpwr_get_base_clock_rate(CLKPWR_SYSCLK), setup);
}

static bool clkpwr_is_pll_locked(enum clkpwr_pll pll)
{
	struct lpc32xx_clkpwr_regs *clkpwr = (struct lpc32xx_clkpwr_regs *)LPC32XX_CLKPWR;
	bool locked = false;
	u32 value;

	switch (pll) {
	case CLKPWR_PLL_PLL397:
		value = readl(&clkpwr->pll397_ctrl);
		if (value & CLKPWR_PLL397_CTRL_STS)
			locked = true;
		break;

	case CLKPWR_PLL_HCLK:
		value = readl(&clkpwr->hclk_pll_ctrl);
		if (value & CLKPWR_HCLKPLL_PLL_STS)
			locked = true;
		else if ((value & CLKPWR_HCLKPLL_POWER_UP) == 0)
			locked = true;
		break;

	case CLKPWR_PLL_USB:
		value = readl(&clkpwr->usb_ctrl);
		if (value & CLKPWR_USBCTRL_PLL_STS)
			locked = true;
		else if ((value & CLKPWR_USBCTRL_PLL_PWRUP) == 0)
			locked = true;
		break;

	default:
		break;
	}

	return locked;
}

static void clkpwr_force_arm_hclk_to_pclk(bool force)
{
	struct lpc32xx_clkpwr_regs *clkpwr = (struct lpc32xx_clkpwr_regs *)LPC32XX_CLKPWR;
	u32 value;

	value = readl(&clkpwr->pwr_ctrl);
	value &= ~CLKPWR_CTRL_FORCE_PCLK;

	if (force)
		value |= CLKPWR_CTRL_FORCE_PCLK;

	writel(value, &clkpwr->pwr_ctrl);
}

#define CPU_CLOCK_RATE 208000000
#define HCLK_DIVIDER 2
#define PCLK_DIVIDER 16

static void setup_clocks(u32 clkrate, u32 hdiv, u32 pdiv)
{
	struct lpc32xx_clkpwr_regs *clkpwr = (struct lpc32xx_clkpwr_regs *)LPC32XX_CLKPWR;
	struct clkpwr_hclk_pll_setup pllcfg;
	u32 value;

	clkpwr_set_hclk_divs(CLKPWR_HCLKDIV_DDRCLK_STOP, 1, 2);
	clkpwr_set_mode(CLKPWR_MODE_DIRECT);
	clkpwr_pll_disable(CLKPWR_PLL_HCLK);
	udelay(2);

	if (clkpwr_get_osc() == CLKPWR_OSC_PLL397) {
		clkpwr_mainosc_setup(0, true);
		udelay(100);

		clkpwr_sysclk_setup(CLKPWR_OSC_MAIN, 0x50);
		clkpwr_pll397_setup(false, 0, false);
	} else {
		clkpwr_sysclk_setup(CLKPWR_OSC_MAIN, 0x50);
	}

	clkrate = clkpwr_find_pll_config(MAIN_OSC_FREQ, clkrate, 5, &pllcfg);
	if (clkrate) {
		clkpwr_hclkpll_setup(&pllcfg);

		while (!clkpwr_is_pll_locked(CLKPWR_PLL_HCLK));

		clkpwr_set_hclk_divs(CLKPWR_HCLKDIV_DDRCLK_STOP, pdiv, hdiv);

		clkpwr_force_arm_hclk_to_pclk(false);
		clkpwr_set_mode(CLKPWR_MODE_RUN);
	}

	value = readl(&clkpwr->pwr_ctrl);
}

#define SDRAM_PERFORMANCE_MODE 1

#define SDRAM_BANKS 2
#define SDRAM_COLS 10
#define SDRAM_ROWS 13

#define SDRAM_REFRESH_INTERVAL 128200
#define SDRAM_CAS_LATENCY 5
#define SDRAM_RAS_LATENCY 2

static u32 ddr_get_bankmask(u32 bankshift, u32 a1, u32 a0)
{
	u32 offset = 0;

	if (bankshift & 1)
		offset = (a0 << 1) | a1;
	else
		offset = (a1 << 1) | a0;

	return offset << bankshift;
}

#define SDRAM_MODE_WORD 0x61
#define SDRAM_EXT_MODE_WORD 0x00
#define SDRAM_EXT_MODE_BB ddr_get_bankmask(bankshift, 0, 1)

static struct sdram_cfg_map {
	u8 banks;
	u8 rows;
	u8 cols;
	u8 config;
} sdram_map[] = {
	{ 2, 13, 10, 0x11 },
	{ 2, 13, 11, 0x10 },
	{ 2, 13,  9, 0x0d },
	{ 2, 12,  9, 0x09 },
	{ 2, 12, 10, 0x08 },
	{ 2, 12,  8, 0x05 },
	{ 1, 11,  8, 0x01 },
	{ 1, 11,  9, 0x00 },
};

#define SDRAM_LP_MASK_BIT (1 << 5)

static u32 ddr_find_config(u32 *modeshift, u32 *bankshift)
{
	const u32 bus32 = 0;
	unsigned int i;
	u32 ret = 0;

	for (i = 0; i < ARRAY_SIZE(sdram_map); i++) {
		if ((sdram_map[i].banks == SDRAM_BANKS) &&
		    (sdram_map[i].rows == SDRAM_ROWS) &&
		    (sdram_map[i].cols == SDRAM_COLS)) {
			ret = sdram_map[i].config;
#ifndef SDRAM_PERFORMANCE_MODE
			ret |= SDRAM_LP_MASK_BIT;
#endif
		}
	}

#ifdef SDRAM_PERFORMANCE_MODE
	*modeshift = SDRAM_COLS + bus32 + 1 + SDRAM_BANKS;
	*bankshift = SDRAM_COLS + bus32 + 1;
#else
	*modeshift = SDRAM_COLS + bus32 + 1;
	*bankshift = SDRAM_COLS + SDRAM_ROWS + bus32 + 1;
#endif

	return ret;
}

#define EMC_DYN_READ_CFG_SDR_CLK_NODLY_CMD_DEL 1
#define EMC_DYN_READ_CFG_SDR_READCAP_POS_POL (1 << 4)
#define EMC_DYN_READ_CFG_DDR_CLK_NODLY_CMD_DEL (1 << 8)
#define EMC_DYN_READ_CFG_DDR_READCAP_POS_POL (1 << 12)
#define EMC_DYN_CFG_DEV_LP_DDR_SDRAM 6

#define CLKPWR_SDRCLK_SLOWSLEW_CLK (1 << 22)
#define CLKPWR_SDRCLK_SLOWSLEW (1 << 21)
#define CLKPWR_SDRCLK_SLOWSLEW_DAT (1 << 20)

static void ddr_clock_resync(u32 cfg)
{
	struct lpc32xx_clkpwr_regs *clkpwr = (struct lpc32xx_clkpwr_regs *)LPC32XX_CLKPWR;
	struct lpc32xx_emc_regs *emc = (struct lpc32xx_emc_regs *)LPC32XX_EMC;
	u32 value;

	value = readl(&clkpwr->sdram_clk_ctrl);
	value |= CLKPWR_SDRCLK_SW_DDR_RESET;
	writel(value, &clkpwr->sdram_clk_ctrl);

	value = readl(&clkpwr->sdram_clk_ctrl);
	value &= ~CLKPWR_SDRCLK_SW_DDR_RESET;
	writel(value, &clkpwr->sdram_clk_ctrl);

	value = (cfg << 7) | EMC_DYN_CFG_DEV_LP_DDR_SDRAM;
	writel(value, &emc->dyn_config0);
}

static void ddr_if_init(u32 cfg)
{
	struct lpc32xx_clkpwr_regs *clkpwr = (struct lpc32xx_clkpwr_regs *)LPC32XX_CLKPWR;
	struct lpc32xx_emc_regs *emc = (struct lpc32xx_emc_regs *)LPC32XX_EMC;
	unsigned int count = 0;
	unsigned int i;
	u32 value;

