avionic-design/u-boot/arch/arm/cpu/arm926ejs/lpc3250/board.c
	value = readl(&clkpwr->hclk_div);
	value &= ~(0x3 << 7);
	value |= CLKPWR_HCLKDIV_DDRCLK_NORM;
	writel(value, &clkpwr->hclk_div);

	ddr_clock_resync(cfg);

	value = readl(&clkpwr->sdram_clk_ctrl);
	value |= CLKPWR_SDRCLK_USE_CAL | CLKPWR_SDRCLK_SENS_FACT(7) |
		CLKPWR_SDRCLK_DQS_DLY(15);
	writel(value, &clkpwr->sdram_clk_ctrl);

	for (i = 0; i < 10; i++) {
		value = readl(&clkpwr->sdram_clk_ctrl);
		value |= CLKPWR_SDRCLK_DO_CAL;
		writel(value, &clkpwr->sdram_clk_ctrl);

		value = readl(&clkpwr->sdram_clk_ctrl);
		value &= ~CLKPWR_SDRCLK_DO_CAL;
		writel(value, &clkpwr->sdram_clk_ctrl);

		udelay(25);

		count += readl(&clkpwr->ddr_lap_count);
	}

	writel(count / 10, &clkpwr->ddr_lap_nom);

	value = readl(&clkpwr->sdram_clk_ctrl);
	value |= CLKPWR_SDRCLK_CAL_ON_RTC;
	value &= ~CLKPWR_SDRCLK_USE_CAL;
	writel(value, &clkpwr->sdram_clk_ctrl);

	value = ((SDRAM_CAS_LATENCY & 0xf) << 7) | (SDRAM_RAS_LATENCY & 0xf);
	writel(value, &emc->dyn_rascas0);

	value = EMC_DYN_READ_CFG_SDR_CLK_NODLY_CMD_DEL |
		EMC_DYN_READ_CFG_SDR_READCAP_POS_POL |
		EMC_DYN_READ_CFG_DDR_CLK_NODLY_CMD_DEL |
		EMC_DYN_READ_CFG_DDR_READCAP_POS_POL;
	writel(value, &emc->dyn_read_cfg);

	value = readl(&clkpwr->sdram_clk_ctrl);
	value &= ~(CLKPWR_SDRCLK_SLOWSLEW_CLK | CLKPWR_SDRCLK_SLOWSLEW | CLKPWR_SDRCLK_SLOWSLEW_DAT);
	writel(value, &clkpwr->sdram_clk_ctrl);
}

#if 0
#define SDRAM_TRP 2
#define SDRAM_TRAS 23809523
#define SDRAM_TSREX 519750
#define SDRAM_TWR 2
#define SDRAM_TRC 7
#define SDRAM_TRFC 13888888
#define SDRAM_TXSR 13333333
#define SDRAM_TRRD 2
#define SDRAM_TMRD 2
#define SDRAM_TCDLR 2

#define TRP(n) \
	(((n) > 15) ? ((clkrate / (n)) & 0xf) : ((n) - 1))
#define TRAS(n) \
	(((n) > 15) ? ((clkrate / (n)) & 0xf) : ((n) - 1))
#define TSREX(n) \
	(((n) > 15) ? ((clkrate / (n)) & 0x7f) : ((n) - 1))
#define TWR(n) \
	(((n) > 15) ? ((clkrate / (n)) & 0xf) : ((n) - 1))
#define TRC(n) \
	((n) & 0x1f)
#define TRFC(n) \
	(((n) > 15) ? ((clkrate / (n)) & 0x1f) : ((n) - 1))
#define TXSR(n) \
	(((n) > 15) ? ((clkrate / (n)) & 0x7f) : ((n) - 1))
#define TRRD(n) \
	(((n) > 15) ? ((clkrate / (n)) & 0xf) : ((n) - 1))
#define TRRD(n) \
	(((n) > 15) ? ((clkrate / (n)) & 0xf) : ((n) - 1))
#define TMRD(n) \
	(((n) > 15) ? ((clkrate / (n)) & 0xf) : ((n) - 1))
#define TCDLR(n) \
	(((n) > 15) ? ((clkrate / (n)) & 0xf) : ((n) - 1))
#else
#define SDRAM_TRP 1
#define SDRAM_TRAS 4
#define SDRAM_TSREX 0x48
#define SDRAM_TWR 1
#define SDRAM_TRC 7
#define SDRAM_TRFC 7
#define SDRAM_TXSR 7
#define SDRAM_TRRD 1
#define SDRAM_TMRD 2
#define SDRAM_TCDLR 2

#define TRP(n) ((n) & 0xf)
#define TRAS(n) ((n) & 0xf)
#define TSREX(n) ((n) & 0x7f)
#define TWR(n) ((n) & 0xf)
#define TRC(n) ((n) & 0x1f)
#define TRFC(n) ((n) & 0x1f)
#define TXSR(n) ((n) & 0xff)
#define TRRD(n) ((n) & 0xf)
#define TMRD(n) ((n) & 0xf)
#define TCDLR(n) ((n) & 0xf)
#endif

static void ddr_adjust_timing(unsigned int clkrate)
{
	struct lpc32xx_emc_regs *emc = (struct lpc32xx_emc_regs *)LPC32XX_EMC;

	writel(TRP(SDRAM_TRP), &emc->dyn_trp);
	writel(TRAS(SDRAM_TRAS), &emc->dyn_tras);
	writel(TSREX(SDRAM_TSREX), &emc->dyn_tsrex);
	writel(TWR(SDRAM_TWR), &emc->dyn_twr);
	writel(TRC(SDRAM_TRC), &emc->dyn_trc);
	writel(TRFC(SDRAM_TRFC), &emc->dyn_trfc);
	writel(TXSR(SDRAM_TXSR), &emc->dyn_txsr);
	writel(TRRD(SDRAM_TRRD), &emc->dyn_trrd);
	writel(TMRD(SDRAM_TMRD), &emc->dyn_tmrd);
	writel(TCDLR(SDRAM_TCDLR), &emc->dyn_tcdlr);
}

static const u8 dqs2calsen[32] = {
	7, 5, 4, 4, 3, 3, 3, 2, 2, 2, 2, 2, 2, 1, 1, 1,
	1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0
};

#define CLKPWR_SDRCLK_SENS_FACT(n) (((n) & 0x7) << 10)
#define CLKPWR_SDRCLK_DQS_DLY(n)   (((n) & 0x1F) << 2)

static void dqsin_ddr_mod(u32 delay)
{
	struct lpc32xx_clkpwr_regs *clkpwr = (struct lpc32xx_clkpwr_regs *)LPC32XX_CLKPWR;
	u32 value;

	value = readl(&clkpwr->sdram_clk_ctrl);
	value &= ~(CLKPWR_SDRCLK_SENS_FACT(7) | CLKPWR_SDRCLK_DQS_DLY(0x1f));
	value |= CLKPWR_SDRCLK_DQS_DLY(delay) | CLKPWR_SDRCLK_SENS_FACT(dqs2calsen[delay]);
	writel(value, &clkpwr->sdram_clk_ctrl);
}

/* TODO: improve this memory test */
static int ddr_memtest(unsigned long base, unsigned long size)
{
	unsigned long step = size / 256;
	unsigned long i;
	int ret = 0;

	for (i = 0; i < size; i += step) {
		u32 value = 0xaa551100;

		writel(value, base + i);
		value = readl(base + i);

		if (value != 0xaa551100) {
			ret = 1;
			break;
		}
	}

	return ret;
}

static int ddr_find_dqsin_delay(unsigned long base, unsigned long size)
{
	int start = 0xff;
	int end = 0xff;
	u32 delay = 1;
	int pass = 0;
	int good = 0;

	while (delay < 31) {
		dqsin_ddr_mod(delay);

		if (ddr_memtest(base, size) == 0) {
			if (start == 0xff)
				start = delay;

			pass = 1;
		} else {
			if (pass == 1) {
				end = delay - 1;
				pass = 0;
				good = 1;
			}
		}

		delay++;
	}

	if (good)
		delay = (start + end) / 2;
	else
		delay = 0xf;

	dqsin_ddr_mod(delay);
	return good;
}

#define EMC_STC_BLS_EN (1 << 7)
#define EMC_STC_MEMWIDTH_16 1

#define EMC_DYN_CLKEN_ALWAYS_ON (1 << 0)
#define EMC_DYN_CLK_ALWAYS_ON (1 << 1)
#define EMC_DYN_DIS_MEMCLK_IN_SFRSH (1 << 3)
#define EMC_DYN_REFRESH_IVAL(n) (((n) >> 4) & 0x7ff)
#define EMC_DYN_NORMAL_MODE 0x000
#define EMC_DYN_CMD_MODE 0x080
#define EMC_DYN_PALL_MODE 0x100
#define EMC_DYN_NOP_MODE 0x180

static void ddr_st_setup(unsigned int clkrate)
{
	struct lpc32xx_clkpwr_regs *clkpwr = (struct lpc32xx_clkpwr_regs *)LPC32XX_CLKPWR;
	struct lpc32xx_emc_regs *emc = (struct lpc32xx_emc_regs *)LPC32XX_EMC;
	u32 modeshift = 0;
	u32 bankshift = 0;
	u32 value;
	u16 word;
	u32 cfg;

	writel(CLKPWR_SDRCLK_USE_DDR, &clkpwr->sdram_clk_ctrl);
	writel(CLKPWR_SDRCLK_HCLK_DLY(15) | CLKPWR_SDRCLK_USE_DDR, &clkpwr->sdram_clk_ctrl);

	writel(EMC_STC_BLS_EN | EMC_STC_MEMWIDTH_16, &emc->stc[0].config);
	writel(EMC_STC_BLS_EN | EMC_STC_MEMWIDTH_16, &emc->stc[1].config);

	cfg = ddr_find_config(&modeshift, &bankshift);
	if (!cfg) {
		serial_puts("ddr_find_config() failed\n");
		return;
	}

	ddr_if_init(cfg);

	ddr_adjust_timing(clkrate);

	value = EMC_DYN_CLK_ALWAYS_ON | EMC_DYN_CLKEN_ALWAYS_ON;

	/* nop mode */
	writel(value | EMC_DYN_NOP_MODE, &emc->dyn_control);
	udelay(200);

	/* precharge all command */
	writel(value | EMC_DYN_PALL_MODE, &emc->dyn_control);
	writel(EMC_DYN_REFRESH_IVAL(4), &emc->dyn_refresh);
	udelay(10);

	/* cmd mode */
	writel(value | EMC_DYN_CMD_MODE, &emc->dyn_control);

	word = readw(0x80000000 + (SDRAM_EXT_MODE_WORD << modeshift) + SDRAM_EXT_MODE_BB);
	udelay(1);

	word = readw(0x80000000 + (((2 << 7) + SDRAM_MODE_WORD) << modeshift));
	udelay(1);

	/* precharge all command */
	writel(value | EMC_DYN_PALL_MODE, &emc->dyn_control);
	udelay(10);
	udelay(25);

	writel(EMC_DYN_REFRESH_IVAL(clkrate / SDRAM_REFRESH_INTERVAL), &emc->dyn_refresh);

