avionic-design/u-boot/arch/arm/cpu/arm926ejs/lpc3250/board.c
	writel(value | EMC_DYN_CMD_MODE, &emc->dyn_control);
	word = readw(0x80000000 + (SDRAM_MODE_WORD << modeshift));
	udelay(1);

	writel(EMC_DYN_NORMAL_MODE | EMC_DYN_DIS_MEMCLK_IN_SFRSH, &emc->dyn_control);
	udelay(10);

	ddr_find_dqsin_delay(0x80000000, 64 << 20);

	value = readl(&clkpwr->sdram_clk_ctrl);
	value |= CLKPWR_SDRCLK_USE_CAL;
	writel(value, &clkpwr->sdram_clk_ctrl);

	(void)word;
}

static void setup_memory(void)
{
	struct lpc32xx_clkpwr_regs *clkpwr = (struct lpc32xx_clkpwr_regs *)LPC32XX_CLKPWR;
	struct lpc32xx_emc_regs *emc = (struct lpc32xx_emc_regs *)LPC32XX_EMC;
	unsigned int rate;

	writel(1, &clkpwr->bootmap);
	writel(0, &clkpwr->sdram_clk_ctrl);

	writel(EMC_CONTROL_DYN_SDRAM_CTRL_EN, &emc->control);
	writel(0, &emc->config);
	writel(0x7ff, &emc->dyn_refresh);

	rate = sys_get_rate(CLKPWR_DDR_CLK);

	ddr_st_setup(rate);

	writel(EMC_AHB_CONTROL_PORTBUFF_EN, &emc->ahb[0].control);
	writel(EMC_AHB_CONTROL_PORTBUFF_EN, &emc->ahb[2].control);
	writel(EMC_AHB_CONTROL_PORTBUFF_EN, &emc->ahb[3].control);
	writel(EMC_AHB_CONTROL_PORTBUFF_EN, &emc->ahb[4].control);

	writel(32, &emc->ahb[0].timeout);
	writel(32, &emc->ahb[2].timeout);
	writel(32, &emc->ahb[3].timeout);
	writel(32, &emc->ahb[4].timeout);

	writel(0x0f, &emc->stc[0].waitwen);
	writel(0x0f, &emc->stc[0].wait0en);
	writel(0x1f, &emc->stc[0].waitrd);
	writel(0x1f, &emc->stc[0].page);
	writel(0x1f, &emc->stc[0].wr);
	writel(0x0f, &emc->stc[0].turn);
}

#ifdef CONFIG_NAND_SPL
void s_init(void)
{
#ifdef CONFIG_SPL_EARLY_DEBUG
	printascii("Hello, World!\n");
	printascii("gdata:");
	printhex(&gdata, 8);
	printascii("\n");

	printascii("bdata:");
	printhex(&bdata, 8);
	printascii("\n");
#endif

	timer_init();

	gd = &gdata;
	gd->bd = &bdata;
	gd->baudrate = 115200;

	serial_init();
	serial_puts("Hello, World\r\n");

	setup_gpio();
	setup_clocks(CPU_CLOCK_RATE, HCLK_DIVIDER, PCLK_DIVIDER);
	setup_memory();

	while (1);
}
#else
void s_init(void)
{
}
#endif
